a <- read.csv("C:/Users/PJW/Documents/R/Mini Project/서울시_우리마을가게_상권분석서비스(상권-점포)_2019년.csv")
names(a)

#성수일로6길
s6_19 <- a %>% filter(상권_코드_명=="성수일로6길") %>% select(기준_년_코드,기준_분기_코드,상권_코드_명,서비스_업종_코드_명,점포_수,개업_율,폐업_률)

s6_19_1 <- s6_19%>% filter(기준_분기_코드 == 1)
s6_19_1 <- s6_19_1[order(-s6_19_1$점포_수),]

s6_19_2 <- s6_19%>% filter(기준_분기_코드 == 2)
s6_19_2 <- s6_19_2[order(-s6_19_2$점포_수),]

s6_19_3 <- s6_19%>% filter(기준_분기_코드 == 3)
s6_19_3 <- s6_19_3[order(-s6_19_3$점포_수),]

s6_19_4 <- s6_19%>% filter(기준_분기_코드 == 4)
s6_19_4 <- s6_19_4[order(-s6_19_4$점포_수),]

#뚝섬로5길
d6_19 <- a %>% filter(상권_코드_명=="뚝섬로5길") %>% select(기준_년_코드,기준_분기_코드,상권_코드_명,서비스_업종_코드_명,점포_수,개업_율,폐업_률)

d6_19_1 <- d6_19%>% filter(기준_분기_코드 == 1)
d6_19_1 <- d6_19_1[order(-d6_19_1$점포_수),]

d6_19_2 <- d6_19%>% filter(기준_분기_코드 == 2)
d6_19_2 <- d6_19_2[order(-d6_19_2$점포_수),]

d6_19_3 <- d6_19%>% filter(기준_분기_코드 == 3)
d6_19_3 <- d6_19_3[order(-d6_19_3$점포_수),]

d6_19_4 <- d6_19%>% filter(기준_분기_코드 == 4)
d6_19_4 <- d6_19_4[order(-d6_19_4$점포_수),]

#성수이로7길
s7_19 <- a %>% filter(상권_코드_명=="성수이로7길") %>% select(기준_년_코드,기준_분기_코드,상권_코드_명,서비스_업종_코드_명,점포_수,개업_율,폐업_률)

s7_19_1 <- s7_19%>% filter(기준_분기_코드 == 1)
s7_19_1 <- s7_19_1[order(-s7_19_1$점포_수),]

s7_19_2 <- s7_19%>% filter(기준_분기_코드 == 2)
s7_19_2 <- s7_19_2[order(-s7_19_2$점포_수),]

s7_19_3 <- s7_19%>% filter(기준_분기_코드 == 3)
s7_19_3 <- s7_19_3[order(-s7_19_3$점포_수),]

s7_19_4 <- s7_19%>% filter(기준_분기_코드 == 4)
s7_19_4 <- s7_19_4[order(-s7_19_4$점포_수),]

#성수이로 18길
s18_19 <- a %>% filter(상권_코드_명=="성수이로18길") %>% select(기준_년_코드,기준_분기_코드,상권_코드_명,서비스_업종_코드_명,점포_수,개업_율,폐업_률)

s18_19_1 <- s18_19%>% filter(기준_분기_코드 == 1)
s18_19_1 <- s18_19_1[order(-s18_19_1$점포_수),]

s18_19_2 <- s18_19%>% filter(기준_분기_코드 == 2)
s18_19_2 <- s18_19_2[order(-s18_19_2$점포_수),]

s18_19_3 <- s18_19%>% filter(기준_분기_코드 == 3)
s18_19_3 <- s18_19_3[order(-s18_19_3$점포_수),]

s18_19_4 <- s18_19%>% filter(기준_분기_코드 == 4)
s18_19_4 <- s18_19_4[order(-s18_19_4$점포_수),]

