c <- read.csv("C:/Users/PJW/Documents/R/Mini Project/서울시 우리마을가게 상권분석서비스(상권-추정매출)_2019.csv")
names(c)

#성수일로6길
h6_19 <- c %>% filter(상권_코드_명=="성수일로6길") %>% select(기준_년_코드,기준_분기_코드,상권_코드_명,서비스_업종_코드_명,"분기당_매출_금액",주중_매출_비율,주말_매출_비율)

h6_19_1 <- h6_19%>% filter(기준_분기_코드 == 1)
h6_19_1 <- h6_19_1[order(-h6_19_1$분기당_매출_금액),]

h6_19_2 <- h6_19%>% filter(기준_분기_코드 == 2)
h6_19_2 <- h6_19_2[order(-h6_19_2$분기당_매출_금액),]

h6_19_3 <- h6_19%>% filter(기준_분기_코드 == 3)
h6_19_3 <- h6_19_3[order(-h6_19_3$분기당_매출_금액),]

h6_19_4 <- h6_19%>% filter(기준_분기_코드 == 4)
h6_19_4 <- h6_19_4[order(-h6_19_4$분기당_매출_금액),]


#뚝섬로6길
h_19 <- c %>% filter(상권_코드_명=="성수일로6길") %>% select(기준_년_코드,기준_분기_코드,상권_코드_명,서비스_업종_코드_명,"분기당_매출_금액",주중_매출_비율,주말_매출_비율)

h_19_1 <- h_19%>% filter(기준_분기_코드 == 1)
h_19_1 <- h_19_1[order(-h_19_1$분기당_매출_금액),]

h_19_2 <- h_19%>% filter(기준_분기_코드 == 2)
h_19_2 <- h_19_2[order(-h_19_2$분기당_매출_금액),]

h_19_3 <- h_19%>% filter(기준_분기_코드 == 3)
h_19_3 <- h_19_3[order(-h_19_3$분기당_매출_금액),]

h_19_4 <- h_19%>% filter(기준_분기_코드 == 4)
h_19_4 <- h_19_4[order(-h_19_4$분기당_매출_금액),]


#성수이로7길
h7_19 <- c %>% filter(상권_코드_명=="성수일로6길") %>% select(기준_년_코드,기준_분기_코드,상권_코드_명,서비스_업종_코드_명,"분기당_매출_금액",주중_매출_비율,주말_매출_비율)

h7_19_1 <- h7_19%>% filter(기준_분기_코드 == 1)
h7_19_1 <- h7_19_1[order(-h7_19_1$분기당_매출_금액),]

h7_19_2 <- h7_19%>% filter(기준_분기_코드 == 2)
h7_19_2 <- h7_19_2[order(-h7_19_2$분기당_매출_금액),]

h7_19_3 <- h7_19%>% filter(기준_분기_코드 == 3)
h7_19_3 <- h7_19_3[order(-h7_19_3$분기당_매출_금액),]

h7_19_4 <- h7_19%>% filter(기준_분기_코드 == 4)
h7_19_4 <- h7_19_4[order(-h7_19_4$분기당_매출_금액),]


#성수이로18길
h18_19 <- c %>% filter(상권_코드_명=="성수일로6길") %>% select(기준_년_코드,기준_분기_코드,상권_코드_명,서비스_업종_코드_명,"분기당_매출_금액",주중_매출_비율,주말_매출_비율)

h18_19_1 <- h18_19%>% filter(기준_분기_코드 == 1)
h18_19_1 <- h18_19_1[order(-h18_19_1$분기당_매출_금액),]

h18_19_2 <- h18_19%>% filter(기준_분기_코드 == 2)
h18_19_2 <- h18_19_2[order(-h18_19_2$분기당_매출_금액),]

h18_19_3 <- h18_19%>% filter(기준_분기_코드 == 3)
h18_19_3 <- h18_19_3[order(-h18_19_3$분기당_매출_금액),]

h18_19_4 <- h18_19%>% filter(기준_분기_코드 == 4)
h18_19_4 <- h18_19_4[order(-h18_19_4$분기당_매출_금액),]
