r <- read.csv("C:/Users/PJW/Documents/R/Mini Project/Commercial district_resident population.csv")

#2019
r2.1 <- r %>% filter(기준_년_코드==2019,상권.코드.명=="서울숲2길") %>% select(기준_년_코드,기준_분기_코드,상권.코드.명,총.상주인구.수,아파트.가구.수,비.아파트.가구.수)
r2.1 <- r2.1[order(r2.1$기준_분기_코드),]

r6.1<- r %>% filter(기준_년_코드==2019,상권.코드.명=="왕십리로6길") %>% select(기준_년_코드,기준_분기_코드,상권.코드.명,총.상주인구.수,아파트.가구.수,비.아파트.가구.수)
r6.1 <- r6.1[order(r6.1$기준_분기_코드),]

r14.1<- r %>% filter(기준_년_코드==2019,상권.코드.명=="왕십리로14길") %>% select(기준_년_코드,기준_분기_코드,상권.코드.명,총.상주인구.수,아파트.가구.수,비.아파트.가구.수)
r14.1 <- r14.1[order(r14.1$기준_분기_코드),]

r1.1<- r %>% filter(기준_년_코드==2019,상권.코드.명=="상원길") %>% select(기준_년_코드,기준_분기_코드,상권.코드.명,총.상주인구.수,아파트.가구.수,비.아파트.가구.수)
r1.1 <- r1.1[order(r1.1$기준_분기_코드),]

r12.1<- r %>% filter(기준_년_코드==2019,상권.코드.명=="상원12길") %>% select(기준_년_코드,기준_분기_코드,상권.코드.명,총.상주인구.수,아파트.가구.수,비.아파트.가구.수)
r12.1 <- r12.1[order(r12.1$기준_분기_코드),]


#2020
r2.2 <- r %>% filter(기준_년_코드==2020,상권.코드.명=="서울숲2길") %>% select(기준_년_코드,기준_분기_코드,상권.코드.명,총.상주인구.수,아파트.가구.수,비.아파트.가구.수)
r2.2 <- r2.2[order(r2.2$기준_분기_코드),]

r6.2<- r %>% filter(기준_년_코드==2020,상권.코드.명=="왕십리로6길") %>% select(기준_년_코드,기준_분기_코드,상권.코드.명,총.상주인구.수,아파트.가구.수,비.아파트.가구.수)
r6.2 <- r6.2[order(r6.2$기준_분기_코드),]

r14.2<- r %>% filter(기준_년_코드==2020,상권.코드.명=="왕십리로14길") %>% select(기준_년_코드,기준_분기_코드,상권.코드.명,총.상주인구.수,아파트.가구.수,비.아파트.가구.수)
r142. <- r14.2[order(r14.2$기준_분기_코드),]

r1.2<- r %>% filter(기준_년_코드==2020,상권.코드.명=="상원길") %>% select(기준_년_코드,기준_분기_코드,상권.코드.명,총.상주인구.수,아파트.가구.수,비.아파트.가구.수)
r1.2 <- r1.2[order(r1.2$기준_분기_코드),]

r12.2<- r %>% filter(기준_년_코드==2020,상권.코드.명=="상원12길") %>% select(기준_년_코드,기준_분기_코드,상권.코드.명,총.상주인구.수,아파트.가구.수,비.아파트.가구.수)
r12.2 <- r12.2[order(r12.2$기준_분기_코드),]

r2 <- rbind(r2.1,r2.2)
r6 <- rbind(r6.1,r6.2)
r14 <- rbind(r14.1,r14.2)
r1 <- rbind(r1.1,r1.2)
r12 <- rbind(r12.1,r12.2)

#2020,2019 분기별 상주인구수
ar.1 <- r2.1$총.상주인구.수+r6.1$총.상주인구.수+r14.1$총.상주인구.수+r1.1$총.상주인구.수+r12.1$총.상주인구.수
ar.2 <- r2.2$총.상주인구.수+r6.2$총.상주인구.수+r14.2$총.상주인구.수+r1.2$총.상주인구.수+r12.2$총.상주인구.수
ar<- data.frame(r2[,c(1,2)])
ar$상주인구수 <- c(9403,9403,9403,9102,9102,9102,9102,9102)

#2020,2019 상주인구수
rr<-data.frame(c('2019','2020'),c(mean(9403,9403,9403,9102),mean(9102,9102,9102,9102)))
names(rr)<-c("기준년도","상주인구수")
ggplot(data=rr, aes(x=기준년도,y=상주인구수)) + geom_col(aes(fill=기준년도),position = 'dodge')+
  ggtitle("2019,2020년도 상주인구수 추이")+theme(plot.title = element_text(family = "serif", face = "bold", hjust = 0.5, size = 15, color = "black"))
