a <- read.csv("C:/Users/PJW/Documents/R/Mini Project/서울시 우리마을가게 상권분석서비스(상권-점포).csv")
d<-read.csv("C:/Users/PJW/Documents/R/Mini Project/서울시_우리마을가게_상권분석서비스(상권-점포)_2019년.csv")

#2020
a2 <- a %>% filter(기준_년_코드==2020,상권_코드_명=="서울숲2길" & 서비스_업종_코드_명 %in% c("패스트푸드점","중식음식점"
                                                          ,"한식음식점","양식음식점","분식전문점","일식음식점","커피-음료","제과점","치킨전문점","호프-간이주점"
                                                          )) %>% select(기준_년_코드,기준_분기_코드,상권_코드_명,서비스_업종_코드_명,점포_수)
a2 <- a2[order(a2$서비스_업종_코드_명),]
a6<- a %>% filter(기준_년_코드==2020,상권_코드_명=="왕십리로6길" & 서비스_업종_코드_명 %in% c("패스트푸드점","중식음식점"
                                                         ,"한식음식점","양식음식점","분식전문점","일식음식점","커피-음료","제과점","치킨전문점","호프-간이주점"
                                                         )) %>% select(기준_년_코드,기준_분기_코드,상권_코드_명,서비스_업종_코드_명,점포_수)
a6 <- a6[order(a6$서비스_업종_코드_명),]
a14<- a %>% filter(기준_년_코드==2020,상권_코드_명=="왕십리로14길" & 서비스_업종_코드_명 %in% c("패스트푸드점","중식음식점"
                                                         ,"한식음식점","양식음식점","분식전문점","일식음식점","커피-음료","제과점","치킨전문점","호프-간이주점"
                                                         )) %>% select(기준_년_코드,기준_분기_코드,상권_코드_명,서비스_업종_코드_명,점포_수)
a14 <- a14[order(a14$서비스_업종_코드_명),]
a1<- a %>% filter(기준_년_코드==2020,상권_코드_명=="상원길" & 서비스_업종_코드_명 %in% c("패스트푸드점","중식음식점"
                                                          ,"한식음식점","양식음식점","분식전문점","일식음식점","커피-음료","제과점","치킨전문점","호프-간이주점"
                                                          )) %>% select(기준_년_코드,기준_분기_코드,상권_코드_명,서비스_업종_코드_명,점포_수)
a1 <- a1[order(a1$서비스_업종_코드_명),]
a12<- a %>% filter(기준_년_코드==2020,상권_코드_명=="상원12길" & 서비스_업종_코드_명 %in% c("패스트푸드점","중식음식점"
                                                       ,"한식음식점","양식음식점","분식전문점","일식음식점","커피-음료","제과점","치킨전문점","호프-간이주점"
                                                       )) %>% select(기준_년_코드,기준_분기_코드,상권_코드_명,서비스_업종_코드_명,점포_수)
a12 <- a12[order(a12$서비스_업종_코드_명),]

x2<-a2$점포_수+a6$점포_수+a14$점포_수+a1$점포_수+a12$점포_수
su.a.2<- data.frame(a6[,c(1,2,4)])

su.a.2$'점포수'<-x2

#2019
a2 <- d %>% filter(기준_년_코드==2019,상권_코드_명=="서울숲2길" & 서비스_업종_코드_명 %in% c("패스트푸드점","중식음식점"
                                                                       ,"한식음식점","양식음식점","분식전문점","일식음식점","커피-음료","제과점","치킨전문점","호프-간이주점"
                                                                       )) %>% select(기준_년_코드,기준_분기_코드,상권_코드_명,서비스_업종_코드_명,점포_수)
a2 <- a2[order(a2$서비스_업종_코드_명),]
a6<- d %>% filter(기준_년_코드==2019,상권_코드_명=="왕십리로6길" & 서비스_업종_코드_명 %in% c("패스트푸드점","중식음식점"
                                                                       ,"한식음식점","양식음식점","분식전문점","일식음식점","커피-음료","제과점","치킨전문점","호프-간이주점"
                                                                       )) %>% select(기준_년_코드,기준_분기_코드,상권_코드_명,서비스_업종_코드_명,점포_수)
a6 <- a6[order(a6$서비스_업종_코드_명),]
a14<- d %>% filter(기준_년_코드==2019,상권_코드_명=="왕십리로14길" & 서비스_업종_코드_명 %in% c("패스트푸드점","중식음식점"
                                                                         ,"한식음식점","양식음식점","분식전문점","일식음식점","커피-음료","제과점","치킨전문점","호프-간이주점"
                                                                         )) %>% select(기준_년_코드,기준_분기_코드,상권_코드_명,서비스_업종_코드_명,점포_수)
a14 <- a14[order(a14$서비스_업종_코드_명),]
a1<- d %>% filter(기준_년_코드==2019,상권_코드_명=="상원길" & 서비스_업종_코드_명 %in% c("패스트푸드점","중식음식점"
                                                                    ,"한식음식점","양식음식점","분식전문점","일식음식점","커피-음료","제과점","치킨전문점","호프-간이주점"
                                                                    )) %>% select(기준_년_코드,기준_분기_코드,상권_코드_명,서비스_업종_코드_명,점포_수)
a1 <- a1[order(a1$서비스_업종_코드_명),]
a12<- d %>% filter(기준_년_코드==2019,상권_코드_명=="상원12길" & 서비스_업종_코드_명 %in% c("패스트푸드점","중식음식점"
                                                                       ,"한식음식점","양식음식점","분식전문점","일식음식점","커피-음료","제과점","치킨전문점","호프-간이주점"
                                                                       )) %>% select(기준_년_코드,기준_분기_코드,상권_코드_명,서비스_업종_코드_명,점포_수)
a12 <- a12[order(a12$서비스_업종_코드_명),]

x1<-a2$점포_수+a6$점포_수+a14$점포_수+a1$점포_수+a12$점포_수
su.a.1<- data.frame(a6[,c(1,2,4)])

su.a.1$'점포수'<-x1
